posts/emacs-droid.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-02-04 Sun 16:47 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Emacs on Droid</title>
<meta name="generator" content="Org mode">
</head>
<body>
<div id="preamble" class="status">
<link rel="stylesheet" type="text/css" href="/stylesheet.css"/>

<p align="right">
<a class="active" href="/"></a> |
<a href="/posts/">Posts</a> |
<a href="/snippets/">Snippets</a> |
<a href="/repository.html">Repository</a> |
<a href="/about.html">About</a> |
<a href="/rss.xml"> rss </a>
</p>
</div>
<div id="content">
<header>
<h1 class="title">Emacs on Droid</h1>
</header>
<div id="outline-container-org57de71b" class="outline-2">
<h2 id="org57de71b">M-x Anything</h2>
<div class="outline-text-2" id="text-org57de71b">
<p>
Emacs is a definite Greatest editor of all time, the extensibility power is unmatched with any other software. Users of Emacs can only know what it is, one who has not used it may not really understand the principles and power it gives us, the users.
</p>

<p>
Once settled with it on PC, its not late to think of something similar for our handy pocket phones, at least support for <b>org-mode</b> so we organize our life. The research leads us to find apps, and its unfortunate that market has lots of apps supporting markdown, just for its markup. Even org-mode is good for markup only, Karl voit&rsquo;s <a href="https://karl-voit.at/2017/09/23/orgmode-as-markup-only/">post</a> explains it very well.
</p>

<p>
Finally we have some apps for org-mode, namely on Android <a href="https://github.com/orgzly/orgzly-android">Orgzly</a> (maintained: <a href="https://github.com/orgzly-revived/orgzly-android-revived">orgzly-revived</a>), Orgro (read-only app) and there is <a href="https://organice.200ok.ch/">Organice</a> (PWA site, unique, supports desktop).
Surprisingly IOS has many apps for org-mode, namely <a href="https://beorgapp.com/">beorg</a> and <a href="https://plainorg.com/">plain org</a> (I dont use IOS, so please search app store).
</p>

<p>
New project under development <a href="https://github.com/Artawower/orgnote-client">OrgNote</a> also looks promising.
</p>

<p>
But it was near February, 2023, that Po Lu, one of the Emacs developer, started and released support for touch-screen devices (including Android) and to our surprise it was <b>the graphical Emacs</b>, available now on Android. But before trying the first doubts and cons expected was that it does not work well with virtual keyboard, so only good option is to carry physical keyboard everywhere?
That could be solved by getting adjusted to keyboard app called &ldquo;Hackers Keyboard&rdquo; (TODO link).
</p>

<p>
But as I dug deep, the developer Po Lu, was on telegram channel in disguise, as I pointed that emacs android needed android&rsquo;s share feature (like open-with) to other people, he had seen it and implemented is very quickly. It shows how much of an interesting take-up it is.
</p>

<p>
Orgzly actually satisfied org-mode and agenda things with help of syncthing over org directory. But the next bummer came when I fell in love with <a href="https://github.com/skeeto/elfeed">Elfeed</a> (RSS reader) and badly wanted to read feeds in sync with my phone. Since Emacs officially made its way for Android, so why not open some doors, indeed it did gave the power of emacs-lisp!
</p>

<p>
Initially I started with bare-bone config, and later tried to incorporate my PC config with android, and it was easy, without much hassle. Just had to define a constant to check if system is on Linux or Android, and use the keyword in condition statements and <code>use-package</code>. Next thought would be to use Unix tools/commands, so it only leads to Termux, and after few days, the developer released Termux signed apk to use in conjunction with emacs, so as to leverage the command line utilities in Android emacs too, namely <code>ripgrep</code>, <code>git</code>. I have not tried <code>image-magick</code>, <code>mupdf</code> for <code>pdf-tools</code>. But frankly <a href="https://github.com/foobnix/LibreraReader">Librera reader</a> is good enough.
</p>

<p>
Here is a <a href="https://marek-g.github.io/posts/tips_and_tricks/emacs_on_android/">blog post</a> by marek-g explaining how termux is modified to use with Emacs
</p>

<p>
Note: Fdroid emacs apk lacks some support like GnuTLS (so won&rsquo;t be able to install package or use eww), thus the only source to get emacs builds for Android is <a href="https://sourceforge.net/projects/android-ports-for-gnu-emacs">https://sourceforge.net/projects/android-ports-for-gnu-emacs</a>
</p>

<p>
For anyone trying it out again or newly, please make sure you go through <code>C-h R android</code> or <code>C-h r m android</code> for frequent issues or things to know for Android build. For any queries to me, please feel free to open up an issue over this <a href="https://github.com/idlip/d-nix">repo</a>.
</p>

<p>
Overall with setting only few variables for android specifically, I replicated almost same emacs config on Android. The definite org-mode reader, read Elfeed feeds in sync with PC, whatever emacs packages you use.
</p>

<p>
Config just for android exclusively:
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;; </span><span class="org-comment">define constant to check if system is android</span>
(<span class="org-keyword">defconst</span> <span class="org-variable-name">d/on-droid</span> (eq system-type 'android))
<span class="org-comment-delimiter">;; </span><span class="org-comment">if system is android, executes following code</span>
(<span class="org-keyword">when</span> d/on-droid
  (custom-set-variables
   '(touch-screen-precision-scroll t) <span class="org-comment-delimiter">;; </span><span class="org-comment">smooth scrolling</span>
   '(touch-screen-display-keyboard t)
   <span class="org-comment-delimiter">;; </span><span class="org-comment">^ display virtual keyboard when touch on phone screen</span>
   <span class="org-comment-delimiter">;; </span><span class="org-comment">does not work on read-only buffer (dashboard, startup..)</span>
   '(browse-url-android-share t))
  <span class="org-comment-delimiter">;; </span><span class="org-comment">open links/urls with android's open-with or share kinda popup</span>

  (<span class="org-keyword">defun</span> <span class="org-function-name">d/key-droid</span>()
    <span class="org-doc">"To enable touch screen keyboard"</span>
    (<span class="org-keyword">interactive</span>)
    (frame-toggle-on-screen-keyboard (selected-frame) nil)
    )
  )
</pre>
</div>

<p>
I&rsquo;m not sure how suitable it is for coding environment (with lsp and complexities), but it behaves as expected for reading purpose and for quick note taking. I should probably say, it excels in that segment.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<br><br>
<!-- <p class="date" id="content" align="left" style="font-size:0.8em;">Posted on: 2023-12-16 Sat 00:00 -->
<!--   <br> -->
<!--  Updated on: 2024-02-04 Sun 16:46 -->
<!-- </p> -->

<p align="center" style="font-size:0.7em;">
<br>
- - - - - - -  - - - - - - -  - - - - - - -  - - - - - - -
<br><br>
 2023 - 2024 <b>Dilip</b>  Made with 󰣐  using <a href="https://orgmode.org/">Org-mode</a> &amp; <a href="https://www.gnu.org/software/emacs/">Emacs</a>
<br>
The <a href="https://github.com/idlip/idlip.github.io">code</a> for this site is licensed under the <a href="https://www.gnu.org/licenses/gpl-3.0.en.html">GPLv3</a>, and the content is licensed under <a href="https://creativecommons.org/licenses/by-sa/4.0/">CC-BY-SA 4.0</a>
</p>

<!-- with org convert -->

<!-- #+attr_html: :align center :style font-size:0.7em; -->
<!-- Made with 󰣐  using [[https://orgmode.org][Org-mode]] & [[https://www.gnu.org/software/emacs/][Emacs]] -->
<!-- The [[https://github.com/idlip/idlip.github.io][code]] for this site is licensed under the [[https://www.gnu.org/licenses/gpl-3.0.en.html][GPLv3]], and the content is licensed under [[https://creativecommons.org/licenses/by-sa/4.0/][CC-BY-SA 4.0]] -->
</div>
</body>
</html>
